name: "TEST"

layer {
  name: "data"
  type: "Python"
  top: "data"
  top: "label"
  python_param {
    module: "metric_data_layer"
	layer: "MetricDataLayer"
	share_in_parallel: true
	param_str: "valid.txt"
  }
}
#layer {
#  name: "loss"
#  type: "SoftmaxWithLoss"
#  bottom: "data"
#  bottom: "label"
#  top: "loss"
#}
layer {
  name: "sil"
  type: "Silence"
  bottom: "data"
  bottom: "label"
}
